---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotChangeCategory
source: html/38efc507-2b00-af23-de5a-6f8346fef2e0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotChangeCategory Property

Can't change category of Family Instance

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotChangeCategory { get; }
```